In [4]:
import pandas as pd
import plotly.express as px
import seaborn as sns
import matplotlib.pyplot as plt

In [5]:
df=pd.read_csv("data_insights")
df

   Unnamed: 0      channel_name  subscribers       views  total_videos
0           0     Luke Barousse       395000    18975148           145
1           1           Ken Jee       254000     8723136           286
2           2  Marques Brownlee     17900000  3907382690          1611
3           3        Tina Huang       593000    27195301           160